[
  {
    "path": "posts/2021-08-16-my-first-blog-post/",
    "title": "My First Blog Post",
    "description": "My data science introduction.",
    "author": [
      {
        "name": "Wylie Hampson",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [],
    "contents": "\nA New Journey\nI recently just began my graduate school journey at UC Santa Barbara. I’m going through their first ever Masters of Environmental Data Science program. As of making this blog post I have only been in school for a few weeks, but I already feel like I’ve learned a ton!\nA function I’ve learned\nWe’ve been working heavily with R and RStudio. One function that I’ve learned about that I think is so cool is the group_by() and summarize() functions. These functions can take a data set and make a summary table that groups it into sub groups. For example, in the classic palmerpenguins data, you can group the penguins by their species and then make a summary table to look at a variable such as mean body size.\n\n\n# Example:\npenguin_summary <- penguins %>% \n  group_by(species) %>% \n  summarize(body_mass_mean = mean(body_mass_g, na.rm = TRUE))\n\npenguin_summary\n\n\n# A tibble: 3 × 2\n  species   body_mass_mean\n  <fct>              <dbl>\n1 Adelie             3701.\n2 Chinstrap          3733.\n3 Gentoo             5076.\n\nOne concept I’ve learned\nOne major lesson that I’ve been learning about in environmental data science is the importance of reproducibility. What reproducibility is, is a way of working so that it is easier for other people and your future self to work with your code and data. The idea of reproducibility is that if someone else were to use your code, they would get the same results as you. Other benefits of reproducibility are making it easy to change values in your code and datasets with ease. Instead of needing to go back and change every floating value in your code, you should be able to just change the value in one location. Although this might sound like it makes writing the code more complicated, in the end it will save hours of extra work.\nData Science: Expectation vs. Reality\nI’m learning new things about data science everyday, and I’m realizing my vision for what working in data science would be like isn’t exactly the same as how it really is. But, in almost every case, the reality has been much better. Data science can be extremely complex with many different tools that one needs to learn in order to work with data. This was a bit intimidating at first, but once you start to pick up on similarities and patterns in R for example, you find that many of the data science tools are quite intuitive. Although the work can be difficult, the rewards can be major. When you successfully get a set of data to convey a message, in my mind it is one of the coolest things about this field. I’ve also realized just how collaborative data science can be, and I’ve already made many connections with people who will help me along the way.\n\n\n\n",
    "preview": "posts/2021-08-16-my-first-blog-post/images/code_stock.jpeg",
    "last_modified": "2021-08-17T12:03:03-07:00",
    "input_file": {}
  }
]
